<template>
  <div class="page-main__container">
    <div class="title__wrapper">
      <h2 class="title__pages">Отзывы клиентов</h2>
    </div>

      <div class="reviews-main__container">
        <div class="reviews-blocks" v-for="(reviews, reviewsClients) in reviewsInformation" :key="reviewsClients">
          <img class="review-images" :src="reviews.logo">
          <div class="review-information__wrapper">
            <h2 class="review-title">{{reviews.naming}}</h2>
            <p class="review-subtitle">{{reviews.surname}}</p>
            <p class="review-text">{{reviews.text}}</p>
            </div>
        </div>
      </div>
  </div>
</template>

<script>
    export default {
        name: "ReviewsPages",
        data () {
            return {
                reviewsInformation: [
                    {
                        logo: require('@/assets/images/reviews/pivnice.jpg'),
                        naming: 'Бар и магазин PIVNICE',
                        surname: 'Зайцев Вадим Игоревич',
                        text: 'ИП Зайцев Вадим Игоревич благодарит компанию ООО «Партнер» за профессиональную работу в сфере автоматизации розничных и оптовых продаж, а также поставки и обслуживания торгового и кассового оборудования. На протяжении последних 4 лет совместно с компанией Партнер мы запустили более 20 розничных магазинов, автоматизировали оптовые продажи, внедрили систему ЕГАИС для приемки и продажи алкогольной продукции. За это время компания Партнер показала себя как надежный деловой партнер, способный оперативно и профессионально решать все вопросы, связанные с системами автоматизации бизнеса. Мы надеемся на дальнейшее сотрудничество и рекомендуем ООО Партнер как надежного партнера для осуществления проектов любой сложности!',
                    },
                    {
                        logo: require('@/assets/images/reviews/steeringwheel.jpg'),
                        naming: 'Автомагазин «Руль»',
                        surname: 'Холмецкий Игорь Сергеевич',
                        text: 'Результатами работы с компанией «Партнер» мы полностью довольны. Были реализованы все поставленные перед нами задачи. На данный момент наше сотрудничество с компанией «Партнер» продолжается. Информационная система учета на базе ПП «Альфа-Авто» регулярно совершенствуется под наши требования, а бесперебойность ее работы позволяет говорить и о дальнейшем сотрудничестве. Сеть магазинов и автотехцентров «Руль» однозначно рекомендует ООО «Партнер» к сотрудничеству. Данная компания зарекомендовала себя как надежный партнер, имеющий в своем составе высококвалифицированных специалистов, которые выполняют поставленные им задачи в намеченные сроки и с высоким качеством.',
                    },
                    {
                        logo: require('@/assets/images/reviews/administration.png'),
                        naming: 'Администрация МВЦУ',
                        surname: 'Директор Мамонова И.Л.',
                        text: 'Благодарим коллектив ООО «Партнер» за проведенные работы по автоматизации учета в нашей организации. В ходе проекта специалистами компании Партнер был выполнен комплекс услуг по автоматизации бухгалтерского и кадрового учета, техническому внедрению программных продуктов на базе системы 1С:Предприятие, услуг сдачи регламентированной отчетности средствами сервиса 1С.Отчетность. Внедренное компанией Партнер, технологическое решение на базе технологии 1С:Фреш позволило решить ряд проблем в нашей организации. Совместная работа нашей организации и компании Партнер привела к повышению эффективности и скорости ведения учета в нашей организации. Благодаря использованию современных технологий мы получили информационную систему, которая полностью удовлетворяет нашим требованиям. Можем рекомендовать к сотрудничеству ООО Партнер как надежную и квалифицированную команду профессионалов, готовых участвовать в проектах любой сложности и успешно их реализовывать.',
                    },
                    {
                        logo: require('@/assets/images/reviews/hops.png'),
                        naming: 'Магазин Эль & Хмель',
                        surname: 'Коростин Роман Сергеевич',
                        text: 'Наша компания плодотворно сотрудничает с ООО «Партнер» уже более 2 лет. Мы начали совместную работу с открытия нашего первого магазина в городе Липецке. На данный момент у нас открыто более 40 магазинов в 4 регионах страны и эти цифры продолжают расти. Такого роста нам удалось достичь в том числе благодаря профессионализму сотрудников компании Партнер и их сопровождению в части информационных технологий и систем автоматизации.\n' +
                            'За время сотрудничества с компанией Партнер были выполнены работы по внедрению программного продукта 1С:Розница для работы магазинов розничной сети и 1С:Управление торговлей для работы менеджерского состава. Информационная система построена по архитектуре распределённых информационных баз и доработана под нашу специфику ведения учета. Внедрения произведены на высоком уровне, скорость разворачивания новых торговых точек высокая, информация о продажах с удаленных магазинов попадает в центральную базу с низкими задержками. Организована дисконтная программа для покупателей. Кассовое и другое торговое оборудование обслуживается быстро и качественно. Сотрудники компании Партнер оперативно реагируют на обращения сотрудников нашей сети по вопросам технического обслуживания, организации маркетинговых мероприятий, обучения новых сотрудников работе в 1С.\n' +
                            'Мы уверены в надежности, ответственности и профессионализме команды компании Партнер, поэтому можем смело рекомендовать ее к сотрудничеству.  \n',
                    },
                    {
                        logo: require('@/assets/images/reviews/bp.png'),
                        naming: 'Компания BP-MOTORS',
                        surname: 'Директор Попова И.А.',
                        text: 'Услуги, оказанные компанией Партнер нам, соответствуют высокому профессиональному уровню. Система автоматизации продаж и автомобильного сервиса на базе 1С:Альфа-Авто. Вместе с системой автоматизации сотрудники компании Партнер производили установку серверного оборудования для системы 1С:Предприятие, и на момент написания данного письма занимаются его обслуживанием. Благодаря этому мы получаем бесперебойный доступ в информационную систему, и регулярные улучшения и рекомендации по техническим вопросам внедрения. Выражаем благодарность сотрудникам компании «Партнер» за плодотворное сотрудничество, эффективную работу, внимательность и лояльное отношение к заказчику. Можем рекомендовать ООО Партнер как надежного партнера в вопросах автоматизации бизнеса и информационных технологий.',
                    },
                    {
                        logo: require('@/assets/images/reviews/oculus.png'),
                        naming: 'Центр микрохирургии глаза «Окулюс»',
                        surname: 'Ген. директор Горькаев В.А.',
                        text: 'Компания Партнер выполняла у нас работы по внедрению информационных систем для ведения учета посетителей медицинского центра, автоматизации продаж аптечной торговой точки, а также программ для ведения бухгалтерии и заработной платы и кадров. На момент начала нашего сотрудничества с организацией ООО «Партнер» мы не смогли найти на рынке программный продукт для учета посетителей медицинского центра, который отвечал бы всем нашим требованиям. Совместно с сотрудниками компании Партнер было решено разрабатывать собственное решение, которое удовлетворило бы наши запросы. Так же совместно с компанией «Партнер» была автоматизирована наша аптечная торговая точка. Для этого была выбрана конфигурация 1С:Розница.Аптека, которая была доработана под наши требования. На данный момент аптечная торговая точка располагает полноценной системой учета в том числе с возможностью продажи маркированных лекарственных средств. Помимо систем учета специалисты компании Партнер занимаются обслуживанием нашего серверного оборудования, на котором развернута система на базе 1С Предприятие и обеспечивают его бесперебойную работу. Мы надеемся на дельнейшее сотрудничество и рекомендуем ООО Партнер как надежного партнера для реализации проектов любой сложности.',
                    },
                    {
                        logo: require('@/assets/images/reviews/staltorg.png'),
                        naming: 'ООО «Стальторг»',
                        surname: 'Исп. директор Николаева Ю.О.',
                        text: 'В начале 2020 года, компания выбрала новую стратегию развития, которая значительно тормозилась разрозненным учетом в нескольких информационных базах, следствием стало решение о модернизации информационной структуры предприятия. В качестве внедряющей компании была выбрана компания Партнер. Специалистами компании Партнер был проведен аудит IT- структуры и осуществлен анализ потребностей. В результате было принято решение о построении единой инфраструктуры в компании Стальторг, а также выбран программный продукт - 1С: Комплексная автоматизация. Компания ООО «Партнёр» продолжает вместе с нами модернизировать и роботизировать информационную систему в рамках договора ИТС и договора абонентского обслуживания.',
                    },
                ]
            }
        }
    }
</script>

<style lang="scss" scoped>
  .page-main__container {
    padding: 0 100px;
  }
  .title__wrapper {
    @extend %titleBackground;
    margin-bottom: 100px;
  }
  .title__pages {
    font-size: $page-title-fontsize;
    font-weight: bold;
  }
  .reviews-main__container {
    padding: 0 100px;
    box-sizing: border-box;
  }
  .reviews-blocks {
    margin: 0 0 100px;
  }
  .review-images {
    height: 8vh;
  }
  .review-title {
    font-weight: bold;
  }
  .review-subtitle {
    color: #5222d0;
    font-size: $additional-fontsize;
    font-weight: bold;
  }
  .review-text {
    color: $color-text;
  }
</style>